# В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так: ...
# А русские буквы оцениваются так: ...
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово, 
# которое содержит либо только английские, либо только русские буквы.

dict_eng = {
    1:'AEIOULNSTR',
    2:'DG',
    3:'BCMP',
    4:'FHVWY',
    5:'K',
    8:'JX',
    10:'QZ'}
dict_ru = {
    1:'АВЕИНОРСТ',
    2:'ДКЛМПУ',
    3:'БГЁЬЯ',
    4:'ЙЫ',
    5:'ЖЗХЦЧ',
    8:'ШЭЮ',
    10:'ФЩЪ'}

Change = int(input('Введите язык игры: 1 - английский, 2 - русский  ->  '))

if (Change ==1 or Change ==2):
    word = input('Введите слово: ').upper()
    if Change == 1:
        print(f"Стоимость введенного слова на английском языке {sum([k for i in word for k,v in dict_eng.items() if i in v])}")
    elif Change == 2:
        print(f"Стоимость введенного слова на русском языке {sum([k for i in word for k,v in dict_ru.items() if i in v])}")
else:
    print('Либо английский (1), либо русский(2) - попробуйте ещё раз.')